/***************************************************************
**
**  Xinwei Telecom Technology co., ltd. ShenZhen R&D center
**  
**  Core Network Department  platform team  
**
**  filename: xosipcl.h
**
**  description: ipc managment defination 
**
**  author: wangzongyou
**
**  date:   2006.6.13
**
***************************************************************
**                          history                     
**  
***************************************************************
**   author          date              modification            
**   zhanglei        2006.6.13              create  
**************************************************************/
#ifndef _XOS_TELNET_H_
#define _XOS_TELNET_H_
#ifdef __cplusplus
extern "C" {
#endif /* _ _cplusplus */

/*-------------------------------------------------------------
                  包含头文件
--------------------------------------------------------------*/ 
#include "xostype.h"
#include "xosmodule.h"
#include "clishell.h"

/*-------------------------------------------------------------
                  宏定义
--------------------------------------------------------------*/

/*-------------------------------------------------------------
                  结构和枚举声明
--------------------------------------------------------------*/



/*-------------------------------------------------------------------------
              接口函数
-------------------------------------------------------------------------*/

/************************************************************************
 函数名:TelnetD_Init() 
 功能:  任务初始化函数
 输入:  
 输出:
 返回:
 说明: 注册到模块管理中
************************************************************************/
XPUBLIC XS8 TelnetD_Init( XVOID *p1, XVOID *p2 );


/************************************************************************
 函数名:TelnetD_msgProc()
 功能:  模块消息处理函数入口
 输入:  pMsg －消息指针
 输出:
 返回: 成功返回XSUCC , 失败返回XERROR 
 说明: 
************************************************************************/
XPUBLIC XS8 TelnetD_msgProc(XVOID* pMsg, XVOID *pMsg2 );

/************************************************************************
 函数名:TelnetD_notice()
 功能:  模块消息处理函数入口
 输入:  pMsg －消息指针
 输出:
 返回: 成功返回XSUCC , 失败返回XERROR 
 说明: 
************************************************************************/
XS8 TelnetD_notice( XVOID* p1, XVOID* p2);

/*-------------------------------------------------------------------------
              内部接口函数
-------------------------------------------------------------------------*/
XBOOL telnetd_ReleaseSID( XS32 s32SID );
#ifdef VXWORKS
  int telnet_register2Ha();
#endif

#ifdef __cplusplus
}
#endif /* _ _cplusplus */

#endif /* _XOS_TELNET_H_ */


