#ifndef  AGENTDB_TASK_H
#define  AGENTDB_TASK_H


#include "agentinclude.h"
#include "SPRDbCliUserInfo.h"
#include "Getmysqldbcfg.h"

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************
函 数 名: SPRDb_InitProc
函数功能: 初始化接口,向平台注册
参    数:
返 回 值:
**************************************************************************/
 XS8 agentDB_InitProc(XVOID *pPara1, XVOID *pPara2 );

/**************************************************************************
函 数 名: SPRDb_XosMsgProc
函数功能: 消息处理接口,向平台注册
参    数:
返 回 值:
**************************************************************************/
 XS8 agentDB_XosMsgProc(XVOID *msg, XVOID *pPara);

/**************************************************************************
函 数 名: SPRDb_TimeoutProc
函数功能: 超时处理接口,向平台注册
参    数:
返 回 值:
**************************************************************************/
 XS8 agentDB_TimeoutProc(t_BACKPARA  *pstPara);

/**************************************************************************
函 数 名: SPRDb_NoticeProc
函数功能: 
参    数:
返 回 值:
**************************************************************************/
 XS8 agentDB_NoticeProc(XVOID* pLVoid, XVOID* pRVoid);



/***************************************************************
函数：DbInitData
功能：初始化连接数据库后进行的初始化数据操作
输入：无
输出：无
返回：XSUCC/XERROR                    
***************************************************************/
XS32 DbInitData(XU32 fid);

/***************************************************************函数：DbInitDataHandler
功能：初始化连接数据库后进行的初始化数据操作,被DbInitData调用，DbInitData被其它地方调用
输入：无
输出：无
返回：XSUCC/XERROR , 这里只是出来返回错误，如果错误由 DbInitData创建定时器                  
***************************************************************/
XS32 DbInitDataHandler(XU32 fid);


/***************************************************************
函数：GetDbCfgInfo
功能：根据是否支持网管配置标示，从配置文件或者oam内存中读取数据库配置信息
输入：SDbConfigInfo *pDbCfgInfo：返回数据库配置信息
输出：无
返回：XSUCC/XERROR                    
***************************************************************/
XS32 GetDbCfgInfo(SDbConfigInfo *pDbCfgInfo);




#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif
