/*----------------------------------------------------------------------------------
    shlrPublic.c - shlr系统公用函数

版权所有 2004 -2006 信威公司深研所SAG项目组.

修改历史记录
--------------------
		11-30-2005,		pengjl 	    创建.
------------------------------------------------------------------------------------*/
/* 
 头文件 
*/


#include <stdio.h>
#include "publictype.h"
#include "xdb_func.h"

/************************************************************************
   功能描述：把 十六进制 转为 字符串
示例：
    输入：0x61，0x62，0x63，0x64
	输出：ab，cd
                                                                  
/************************************************************************/

XU64 USER_HexToStr(XU8 *pHex,XU8 * pStr,XU64 ulLen)
{
	XU64 i;

	for (i=0; i< ulLen;i++)
	{
 		pStr[i] = USER_ChrToHex(pHex[2*i]) * 16 + USER_ChrToHex(pHex[2*i+1]);
	}

	return XSUCC;
}
/***********************************
功能描述：把ASCII字符转为十六进制
示例：
     输入 0x61
	 输出 0x0a
************************************/
XU8 USER_ChrToHex(XU8 chr)
{
	XU8 temp1[17]="0123456789abcdef";
	XU8 temp2[7]="ABCDEF";
	XU8 i;

	for (i=0; i< 16;i++)
	{
		if (chr == temp1[i])
			return i;
	}
	for (i=0; i< 6;i++)
	{
		if (chr == temp2[i])
			return 10+i;
	}

	return -1;
}
/************************************************************************
   功能描述：把 字符串 转为 十六进制
示例：
    输入：ab，cd
	输出：0x61，0x62，0x63，0x64
                                                                  
/************************************************************************/
XU64 USER_StrToHex(XU8 * pStr,XU8 *pHex,XU64 ulLen)
{
	XU64 i;

	for (i=0; i< ulLen;i++)
	{
		pHex[2*i]   = ( pStr[i] / 16 > 9) ?(55 + pStr[i] / 16 ):(48 + pStr[i] / 16 );
		pHex[2*i+1] = ( pStr[i] % 16 > 9) ?(55 + pStr[i] % 16 ):(48 + pStr[i] % 16 );
	}

	return XSUCC;
}



